In [1]:
import pandas as pd

In [50]:
inflation = pd.read_csv('../data/inflation_fred.csv')

In [57]:
inflation.head()

   CPIAUCSL       date
0     29.01 1959-01-01
1     29.00 1959-02-01
2     28.97 1959-03-01
3     28.98 1959-04-01
4     29.04 1959-05-01

In [54]:
# changing to datetime format as the other dataset 
inflation['date'] = pd.to_datetime(inflation['observation_date'], format='%m/%d/%Y', errors='coerce')

In [56]:
inflation = inflation.drop(columns=['observation_date'])

In [13]:
unemployment = pd.read_csv('../data/unemployment_bls.csv', skiprows = 11)

In [110]:
unemployment.head()

   Year  Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
0  1959  6.0  5.9  5.6  5.2  5.1  5.0  5.1  5.2  5.5  5.7  5.8  5.3
1  1960  5.2  4.8  5.4  5.2  5.1  5.4  5.5  5.6  5.5  6.1  6.1  6.6
2  1961  6.6  6.9  6.9  7.0  7.1  6.9  7.0  6.6  6.7  6.5  6.1  6.0
3  1962  5.8  5.5  5.6  5.6  5.5  5.5  5.4  5.7  5.6  5.4  5.7  5.5
4  1963  5.7  5.9  5.7  5.7  5.9  5.6  5.6  5.4  5.5  5.5  5.7  5.5

In [18]:
month_mapping = {'Jan': '01', 'Feb': '02', 'Mar': '03',
                 'Apr': '04', 'May': '05', 'Jun': '06',
                 'Jul': '07', 'Aug': '08', 'Sep': '09',
                 'Oct': '10', 'Nov': '11', 'Dec': '12'}

In [41]:
unemployment_long = pd.melt(unemployment, 
        id_vars = ['Year'],
        var_name = 'Month', 
        value_name= 'unemployment_rate'
        )

In [43]:
unemployment_long['month_num'] = unemployment_long['Month'].map(month_mapping)

In [44]:
unemployment_long['date'] =unemployment_long['Year'].astype(str) + '-' + unemployment_long['month_num']

In [45]:
unemployment_long['date'] = pd.to_datetime(unemployment_long['date'], format='%Y-%m', errors='coerce')

In [46]:
unemployment_long = unemployment_long.drop(columns = ['Year', 'Month', 'month_num'])

In [47]:
unemployment_long.head()

   unemployment_rate       date
0                6.0 1959-01-01
1                5.2 1960-01-01
2                6.6 1961-01-01
3                5.8 1962-01-01
4                5.7 1963-01-01

In [95]:
debt = pd.read_csv('../data/debt_fed.csv')

In [109]:
debt.head(15)

   revolving_credit nonrevolving_credit total_credit       date
5               NaN             6577.83      6577.83 1943-01-01
6               NaN             6463.04      6463.04 1943-02-01
7               NaN             6234.21      6234.21 1943-03-01
8               NaN             6125.75      6125.75 1943-04-01
9               NaN             5936.26      5936.26 1943-05-01
10              NaN             5822.23      5822.23 1943-06-01
11              NaN             5718.37      5718.37 1943-07-01
12              NaN             5638.75      5638.75 1943-08-01
13              NaN             5647.59      5647.59 1943-09-01
14              NaN             5650.74      5650.74 1943-10-01
15              NaN             5576.87      5576.87 1943-11-01
16              NaN             5462.52      5462.52 1943-12-01
17              NaN             5398.57      5398.57 1944-01-01
18              NaN             5354.36      5354.36 1944-02-01
19              NaN             5370.36      5370.36 1944-03-01

In [97]:
debt.columns = debt.columns.str.strip()

debt = debt[['Series Description', 
             'Revolving consumer credit owned and securitized, seasonally adjusted level', 
             'Nonrevolving consumer credit owned and securitized, seasonally adjusted level', 
             'Total consumer credit owned and securitized, seasonally adjusted level']]

In [98]:
# removing the first five rows to remove informational rows
debt = debt.iloc[5:]

In [103]:
debt['date'] = pd.to_datetime(debt['Series Description'], format='%Y-%m', errors='coerce')

In [105]:
debt = debt.drop(columns=['Series Description'])

In [108]:
debt.rename(columns = {
    'Revolving consumer credit owned and securitized, seasonally adjusted level': 'revolving_credit',
    'Nonrevolving consumer credit owned and securitized, seasonally adjusted level': 'nonrevolving_credit',
    'Total consumer credit owned and securitized, seasonally adjusted level': 'total_credit'
}, inplace=True)